Structural Connection has an inappropriate type assigned.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId StructuralConnectionWrongType { get; }
  Visual Basic
Public Shared ReadOnly Property StructuralConnectionWrongType As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ StructuralConnectionWrongType {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StructuralConnectionFailures Class
  Autodesk.Revit.DB Namespace